import classes


def guidelines():
    """Η εργασία αποτελεί ένα πρόγραμμα: Scrabble για το Μαθημα: Θεωρίες Μαθησης και Εκπαιδευτικό λογισμικό από τον
    Ρωμανό Γεώργιο με ΑΕΜ 3101 από 6ο εξάμηνο για την παράδωση της τον Σεπτέμβριο του 2020.

    Σύμφωνα με τα ζητουμενα της επίσημης παράδωσης της εργασίας ως έγκυρης, οφείλω να αναφέρω πως οι πηγές μου, εκτός
    από τις δικές μου γνώσεις, αποτελούν διάφορα παραδείγματα από το stackoverflow για την κατανόηση καποιων βιβλιωθικών
    και ορισμένων αντιμετώπισης συγκεκριμένων προβλημάτων που χρειάστηκα να επιλύσω.

    Το σενάριο που υλοποιήθηκε για τον υπολογιστή είναι το "Σενάριο 1" της εκφώνισης της εργασίας με τους 3 τροπους
    παιχνιδιού του υπολογιστή: Min_Letters, Max_Letters, Smart. Ολες οι μέθοδοι των κλάσεων είναι public για την
    μεμονομένη κληση τους απο την main για γρηγορότερο testing (δεδομένης της προσθήκης των κατάλληλων απαιτούμενων
    ορισμάτων)

    Για την σύντομη επισκόπηση των κλάσεων και μεθόδων τους πλητρολογίστε στην main: help(classes). Για την
    επεκτεταμένη επισκόπιση των κλάσεων με τον κώδικα, δείτε το αρχείο: classes.py, οπου παρέχεται ο κώδικας, συν
    επιπροσθέτων σχολίων για την ευκολότερη κατανόηση της λειτουργίας κάποιων γραμμών κώδικα. Ο σχολιασμός είναι στα
    αγγλικά.

    Όλες οι κλάσεις έχουν repr, αλλά ορισμένα από τα ορίσματα τους ενδεχομένως μπορούν να εμφανιστούν/επιστραφούν με
    άλλες μεθόδους τους για ποικοίλους λόγους (π.χ. η κλάση game δεν εμφανίζει το self.dictionary_data μεσω τις repr,
    διότι καταλαμβάνει τεράστιο χώρο στο terminal). Συνεπώς, η repr ενδεχομένως να εμφανίζει υποσύνολο όλων των πεδίων
    της, τα οποία θεωρούνται βασικότερα και ως έξοδο του με την repr φαίνονται καθαρά στον χρήστη.

    Για να τρέξετε τον κώδικα, τρέξτε τις 2 εντολές: [instance] = classes.Game() και έπειτα: [instance].begin(), με
    [instance] το όνομα του στιγμιοτύπου του αντικειμένου (π.χ. game)

    Συμβάσεις: Καθώς το αρχείο 'greek7.txt' περιλαμβάνει έγκυρες λέξεις με 1 γράμμα, επιτρέπεται η χρήση των λέξεων
    με 1 γράμμα σε αυτήν την έκδοση του Scrabble. Επίσης, ως παικτης 1 θεωρέιται ο χρήστης ενώ ο παίκτης 2 θεωρείται
    ο υπολογιστής. Τελος, μιας και ο οδηγος δεν το επισημανε αρκετα (οδηγός εργασίας scrabble, διαφάνεια 24,
    Σενάριο παιχνιδιού 6-1 και 6-3), θεωρώ την σύμβαση πως το παιχνίδι τελειώνει εάν ένας παίκτης (είτε υπολογιστής είτε
    παίκτης) δεν μπορεί να σχηματίσει λέξη με τα γράμματα που έχει εφόσον ο σάκος είναι άδειος"""


if __name__ == '__main__':
    help(guidelines)
    # help(classes)
    # game = classes.Game()
    # game.begin()






